# Напишите программу, которая принимает на вход число N 
# и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)

for i in range(2):
    for j in range(2):
        for k in range(2):
            i or j or k == i and j and k
            print('true')