# Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# Входные и выходные данные хранятся в отдельных текстовых файлах.
import math

d = input('Введите точность:').split('.')
pi = math.pi
print(round(pi, len(d[1])))